{
  "michaelLee": "Michael Lee",
  "about": "About",
  "contact": "Contact",
  "name": "Name",
  "email": "Email",
  "subject": "Subject",
  "message": "Message",
  "experience": "Work Experience",
  "education": "Education",
  "projects": "Side Projects",
  "aboutMe": "About Me",
  "universityDegrees": "University Degrees",
  "certifications": "Certifications",
  "submit": "Submit",
  "description": "Michael Lee's Portfolio",
  "softwareEngineer": "Software Engineer",
  "flavourText": "I am a highly skilled Software Developer specializing in full-stack, cloud-based web development using technologies such as React, Vue, TypeScript, Java, C#, and Microsoft Azure. With a proven track record of building scalable, user-centric web applications, I excel at optimizing system performance and delivering innovative solutions that enhance user satisfaction and operational efficiency.\n\nAfter transitioning from a traditional engineering background, I earned a Master of Engineering degree in Software Engineering from the University of Calgary in 2020. Since then, I have pursued a professional career as a web developer with no regrets, continuously seeking opportunities to grow and improve. I am passionate about tackling challenges, enhancing my expertise, and contributing to projects that promote professional development and innovation in the software industry.",
  "webDevelopment": "Web Development",
  "openApplication": "Open Application",
  "viewCode": "View Code",
  "openMainMenu": "Open main menu",
  "sideProjects": [
    {
      "title": "Next Generation Multilingual Dictionary Web Application",
      "codeUrl": "https://github.com/MichaelMauriceLee/chie",
      "modalInfo": {
        "imageUrl": "/images/projects/chie.jpg",
        "description": "A cutting-edge web application built using Next.js, Azure Cognitive Services, and Azure OpenAI. This innovative platform enables users to obtain detailed definitions of their entered words through a custom ChatGPT model. With seamless integration, users can effortlessly add words to their chosen Anki decks with a single click. The application also features image-to-text conversion capabilities powered by Azure, enhancing accessibility and functionality."
      },
      "cardInfo": {
        "imageUrl": "/images/projects/chie-sm.jpg",
        "description": "A state-of-the-art multilingual dictionary with advanced image recognition and Anki deck integration."
      },
      "webAppURL": "https://chie.vercel.app"
    },
    {
      "title": "Social Media Web Application",
      "codeUrl": "https://github.com/MichaelMauriceLee/Connectivities",
      "modalInfo": {
        "imageUrl": "/images/projects/connectivities.jpg",
        "description": "A robust full-stack social media platform, akin to Meetup.com, crafted using ASP.NET Core, Microsoft SQL Server, and React. Deployed on Microsoft Azure, this application empowers users to create, search, and participate in events while connecting with like-minded individuals. Additional features include event commenting, profile photo uploads, follower management, and a dynamic event discovery system."
      },
      "cardInfo": {
        "imageUrl": "/images/projects/connectivities-sm.jpg",
        "description": "A comprehensive social media platform designed for event discovery and community building."
      },
      "webAppURL": "https://connectivities.azurewebsites.net"
    },
    {
      "title": "TensorFlow Real Time Object Detection Program",
      "codeUrl": "https://github.com/MichaelMauriceLee/FF14-Race-Identifer",
      "modalInfo": {
        "imageUrl": "/images/projects/ff14-race-identifer.jpg",
        "description": "A sophisticated real-time object detection program tailored for identifying character races and genders from the game Final Fantasy XIV. Using TensorFlow's Object Detection API, this application retrains Google's Faster R-CNN Inception V2 COCO model to analyze on-screen images of characters. It delivers instant insights by displaying character race and gender information directly on the screen, elevating user engagement and interaction."
      },
      "cardInfo": {
        "imageUrl": "/images/projects/ff14-race-identifer-sm.jpg",
        "description": "An advanced object detection tool for identifying character races and genders in Final Fantasy XIV in real time."
      }
    }
  ],
  "workExperience": [
    {
      "jobTitle": "Frontend Developer",
      "company": "Renoworks Software",
      "location": "Calgary",
      "dateRange": "April 2025 - Present",
      "imageUrl": "/images/work-experience/renoworks.jpg",
      "imageAlt": "Renoworks Software logo",
      "notableAccomplishments": [
        "Spearheaded the design and implementation of a new component architecture for the next-generation Renoworks platform, establishing scalable patterns and reusable UI components that improved developer velocity and code consistency.",
        "Led feature development for a new React application built for Westlake Building Supplies (Royal), driving end-to-end implementation from requirements gathering to production deployment.",
        "Brought in during the critical final phase of the Owens Corning project to rapidly implement key feature changes, helping deliver the application on time for a Fortune 500 building materials leader with $11 billion in annual revenue.",
        "Drove frontend performance improvements by introducing modern tooling including React Compiler and Vite, significantly enhancing build times, runtime performance, and overall developer experience."
      ]
    },
    {
      "jobTitle": "Software Developer",
      "company": "Child Friendly Care",
      "location": "Calgary",
      "dateRange": "October 2023 - April 2025",
      "imageUrl": "/images/work-experience/cf.jpg",
      "imageAlt": "Child Friendly Care logo",
      "notableAccomplishments": [
        "Led a cross-functional team of developers and QA, ensuring stakeholder priorities were met and team ceremonies adhered to agile practices.",
        "Revamped the 'attendance' microservice and data structure, enabling it to scale for 2,500+ students, reducing urgent issues by 95% and increasing system reliability and user satisfaction.",
        "Developed and integrated a Google Calendar-inspired feature, enhancing event management for 100+ staff members and enabling seamless scheduling across the system.",
        "Integrated Capacitor to streamline mobile app development and manage mobile releases, ensuring feature parity with the web app while minimizing maintenance effort."
      ]
    },
    {
      "jobTitle": "Software Developer",
      "company": "Morgan Stanley at Work",
      "location": "Calgary",
      "dateRange": "May 2021 - October 2023",
      "endDate": "Present",
      "imageUrl": "/images/work-experience/morgan-stanley.jpg",
      "imageAlt": "Morgan Stanley at Work logo",
      "notableAccomplishments": [
        "Revamped the release election process using React, improving the user experience for holders of multiple vested restricted stock units.",
        "Led development of a React investor web application using modern technologies like RTK Query, React Hook Form, and Zod, enabling faster iterations and better developer experience.",
        "Supported Cisco’s successful migration of 71,000+ employees onto the platform by enhancing data validation rules."
      ]
    },
    {
      "jobTitle": "Software Developer",
      "company": "Child Friendly Care",
      "location": "Calgary",
      "dateRange": "May 2020 - May 2021",
      "imageUrl": "/images/work-experience/cf.jpg",
      "imageAlt": "Child Friendly Care logo",
      "notableAccomplishments": [
        "Integrated financial data transfer between the web app and QuickBooks via REST API calls.",
        "Set up and managed Azure CI/CD pipelines and testing architecture for microservices."
      ]
    },
    {
      "jobTitle": "Intern, Facilities Engineering",
      "company": "ATCO Gas Transmission",
      "location": "Edmonton",
      "dateRange": "May 2017 - August 2018",
      "imageUrl": "/images/work-experience/atco.jpg",
      "imageAlt": "ATCO logo",
      "notableAccomplishments": [
        "Spearheaded the design of a modernized meter station, replacing an outdated facility, with a meticulously planned budget of $350K.",
        "Directed the complete decommissioning and land reclamation of a meter station, delivering the project on time and within a $200K budget.",
        "Successfully reviewed and ensured procedural accuracy for a high-priority $1 million project within a tight one-week deadline, contributing to its seamless execution."
      ]
    },
    {
      "jobTitle": "Summer Student, Relief Operator",
      "company": "Canadian Natural Resources Limited",
      "location": "Lloydminster",
      "dateRange": "May 2016 - August 2016",
      "imageUrl": "/images/work-experience/cnrl.jpg",
      "imageAlt": "Canadian Natural Resources Limited logo",
      "notableAccomplishments": [
        "Managed daily operations of 34 heavy oil wells across the Marshall and Lone Rock oil fields, ensuring optimal production within the Lloydminster district.",
        "Conducted comprehensive maintenance tasks and accurately logged production data for enhanced operational efficiency.",
        "Improved well performance by analyzing fluid levels and calibrating pump speeds for maximum productivity.",
        "Coordinated and streamlined various well service operations, minimizing downtime through effective organization and collaboration with service teams."
      ]
    },
    {
      "jobTitle": "Leader",
      "company": "University of Calgary",
      "location": "Calgary",
      "dateRange": "July 2015 - August 2015",
      "imageUrl": "/images/work-experience/uofc.jpg",
      "imageAlt": "University of Calgary logo",
      "notableAccomplishments": [
        "Guided and mentored young attendees, fostering an engaging and supportive environment.",
        "Designed and implemented innovative activities, enhancing the camp's educational and recreational offerings.",
        "Collaborated with instructors to teach new skills, ensuring a meaningful and enriching camp experience."
      ]
    }
  ],
  "educationItems": [
    {
      "dateRange": "September 2019 - August 2020",
      "title": "MEng, Software Engineering",
      "institution": "University of Calgary, Schulich School of Engineering",
      "location": "Calgary, Alberta",
      "accomplishment": "3.97/4.0 GPA"
    },
    {
      "dateRange": "September 2014 - April 2019",
      "title": "BSc, Chemical Engineering with minor in Petroleum Engineering",
      "institution": "University of Calgary, Schulich School of Engineering",
      "location": "Calgary, Alberta",
      "accomplishment": "Graduated with Distinction; 3.78/4.0 GPA"
    }
  ],
  "certificationItems": [
    {
      "title": "JLPT - N2",
      "date": "July 2023"
    }
  ],
  "emailSuccessfullySent": "Email successfully sent!",
  "errors": {
    "invalidEmail": "Must be a valid email address",
    "nameRequired": "Name is required",
    "emailRequired": "Email is required",
    "subjectRequired": "Subject is required",
    "messageRequired": "Message is required"
  },
  "sections": {
    "about": "about",
    "workExperience": "work-experience",
    "sideProjects": "side-projects",
    "contact": "contact",
    "education": "education",
    "certifications": "licences-and-certifications"
  }
}